# Rebar Bend Data Crank Length 0 Property

Source: https://www.revitapidocs.com/2026/aa8a36ba-cb49-4694-6f9b-5b3d5e5a316f.htm

---

| Rebar Bend Data Crank Length 0 Property |
| --- |

Identifies the crank length at the start.

The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CrankLength0 { get; }
```

```
Public ReadOnly Property CrankLength0 As Double
	Get
```

```
public:
property double CrankLength0 {
	double get ();
}
```

```
member CrankLength0 : float with get
```

#### Property Value

Double See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace